# bypass-global-grok-parser-rules-checks
id: haproxy
metric_id: haproxy
backend_only: false
facets:
  - facetType: range
    groups:
      - Measure
    name: Duration
    path: duration
    source: log
    type: double
    unit:
      family: time
      name: nanosecond
  - groups:
      - Web Access
    name: Method
    path: http.method
    source: log
  - groups:
      - Web Access
    name: Referer
    path: http.referer
    source: log
  - groups:
      - Web Access
    name: Status Code
    path: http.status_code
    source: log
  - groups:
      - Web Access
    name: URL Host
    path: http.url_details.host
    source: log
  - groups:
      - Web Access
    name: URL Path
    path: http.url_details.path
    source: log
  - groups:
      - Web Access
    name: URL Port
    path: http.url_details.port
    source: log
  - groups:
      - Web Access
    name: URL scheme
    path: http.url_details.scheme
    source: log
  - groups:
      - Web Access
    name: Browser
    path: http.useragent_details.browser.family
    source: log
  - groups:
      - Web Access
    name: Device
    path: http.useragent_details.device.family
    source: log
  - groups:
      - Web Access
    name: OS
    path: http.useragent_details.os.family
    source: log
  - groups:
      - Web Access
    name: Client IP
    path: network.client.ip
    source: log
  - groups:
      - OCSF
    name: Activity ID
    path: ocsf.activity_id
    source: log
  - groups:
      - OCSF
    name: Category ID
    path: ocsf.category_uid
    source: log
  - groups:
      - OCSF
    name: Category
    path: ocsf.category_name
    source: log
  - groups:
      - OCSF
    name: Class ID
    path: ocsf.class_uid
    source: log
  - groups:
      - OCSF
    name: Class
    path: ocsf.class_name
    source: log
  - groups:
      - OCSF
    name: Source IP Address
    path: ocsf.src_endpoint.ip
    source: log
  - groups:
      - OCSF
    name: Status
    path: ocsf.status
    source: log
  - groups:
      - OCSF
    name: Status ID
    path: ocsf.status_id
    source: log
  - groups:
      - OCSF
    name: Request URL String
    path: ocsf.http_request.url.url_string
    source: log
pipeline:
  type: pipeline
  name: Haproxy
  enabled: true
  filter:
    query: source:haproxy
  processors:
    - type: grok-parser
      name: ''
      enabled: true
      source: message
      samples:
        - 10.0.1.2:33317 [06/Feb/2009:12:14:14.655] http-in static/srv1 10/0/30/69/109 200 2750 - - ---- 1/1/1/1/0 0/0 {1wt.eu} {} "GET /index.html HTTP/1.1"
        - 10.0.1.2:33313 [06/Feb/2009:12:12:51.443] fnt bck/srv1 34/56/5007 212 -- 1/3/6/8/13 15/17
        - Connect from 10.0.1.2:33312 to 10.0.3.31:8012 (www/HTTP)
      grok:
        supportRules: |
          _actconn %{integer:haproxy.actconn}
          _backend_queue %{integer:haproxy.backend_queue}
          _backend_name %{notSpace:haproxy.backend_name}
          _beconn %{integer:haproxy.beconn}
          _bytes_sent %{integer:network.bytes_written}
          _captured_request_headers %{data:haproxy.captured_request_headers}
          _captured_response_headers %{data:haproxy.captured_response_headers}
          _captured_request_cookie %{data:haproxy.captured_request_cookie}
          _captured_response_cookie %{data:haproxy.captured_response_cookie}
          _client_ip %{ipOrHost:network.client.ip}
          _client_port %{integer:network.client.port}
          _date_haproxy \[%{date("dd/MMM/yyyy:HH:mm:ss.SSS"):date_access}\]
          _destination_ip %{ip:network.destination.ip}
          _destination_port %{integer:network.destination.port}
          _feconn %{integer:haproxy.feconn}
          _frontend_name %{notSpace:haproxy.frontend_name}
          _ha_mode %{notSpace:haproxy.mode}
          _http_version HTTP\/%{regex("\\d+\\.\\d+"):http.version}
          _http_url %{notSpace:http.url}
          _duration %{integer:duration:scale(1000000)}
          _retries %{integer:haproxy.retries}
          _server_name %{notSpace:load_balancer.service_name}
          _srvconn %{integer:haproxy.srvconn}
          _srv_queue %{integer:haproxy.srv_queue}
          _status_code %{integer:http.status_code}
          _termination_state %{notSpace:haproxy.termination_state}
          _time_request %{integer:haproxy.time_request}
          _time_queue %{integer:haproxy.time_queue}
          _time_backend_connect %{integer:load_balancer.time_backend_connect}
          _time_backend_response %{integer:haproxy.time_backend_response}
          _method %{word:http.method}
          _syslog_prefix (%{date("MMM dd HH:mm:ss"):syslog.date}|%{date("MMM  d HH:mm:ss"):syslog.date}|%{date("yyyy-MM-dd'T'HH:mm:ssZ"):syslog.date}) %{notSpace:syslog.host} haproxy\[%{number:haproxy.pid}\]:
        matchRules: |
          haproxy.http (%{_syslog_prefix}\s+)?%{_client_ip}:%{_client_port} %{_date_haproxy} %{_frontend_name} %{_backend_name}/%{_server_name} %{_time_request}/%{_time_queue}/%{_time_backend_connect}/%{_time_backend_response}/%{_duration} %{_status_code} %{_bytes_sent} %{_captured_request_cookie} %{_captured_response_cookie} %{_termination_state} %{_actconn}/%{_feconn}/%{_beconn}/%{_srvconn}/%{_retries} %{_srv_queue}/%{_backend_queue} (\{%{_captured_request_headers}\})?(\s)?(\{%{_captured_response_headers}\})?(\s)?"%{_method} %{_http_url}( %{_http_version})?"

          haproxy.tcp (%{_syslog_prefix}\s+)?%{_client_ip}:%{_client_port} %{_date_haproxy} %{_frontend_name} %{_backend_name}/%{_server_name} %{_time_queue}/%{_time_backend_connect}/%{_duration} %{_bytes_sent} %{_termination_state} %{_actconn}/%{_feconn}/%{_beconn}/%{_srvconn}/%{_retries} %{_srv_queue}/%{_backend_queue}

          haproxy.default (%{_syslog_prefix}\s+)?Connect from %{_client_ip}:%{_client_port} to %{_destination_ip}:%{_destination_port} \(%{_frontend_name}\/%{_ha_mode}\)

    - type: url-parser
      name: ''
      enabled: true
      sources:
        - http.url
      target: http.url_details
    - type: user-agent-parser
      name: ''
      enabled: true
      sources:
        - http.useragent
      target: http.useragent_details
      encoded: false
    - type: date-remapper
      name: Define `date_access` as the official date of the log
      enabled: true
      sources:
        - date_access
    - type: category-processor
      name: Categorise status code
      enabled: true
      categories:
        - filter:
            query: '@http.status_code:[200 TO 299]'
          name: OK
        - filter:
            query: '@http.status_code:[300 TO 399]'
          name: notice
        - filter:
            query: '@http.status_code:[400 TO 499]'
          name: warning
        - filter:
            query: '@http.status_code:[500 TO 599]'
          name: error
      target: http.status_category
    - type: status-remapper
      name: Define `http.status_category` as the official status of the log
      enabled: true
      sources:
        - http.status_category
    - type: pipeline
      name: OCSF pre transformations
      enabled: true
      ocsf:
        isOcsf: true
      filter:
        query: "*"
      processors:
        - type: string-builder-processor
          name: Add product name
          enabled: true
          template: "HAProxy"
          target: ocsf.metadata.product.name
          replaceMissing: false
        - type: string-builder-processor
          name: Add product vendor
          enabled: true
          template: "HAProxy"
          target: ocsf.metadata.product.vendor_name
          replaceMissing: false
    - type: pipeline
      name: OCSF sub pipeline for class Network Activity [4001]
      enabled: true
      ocsf:
        isOcsf: true
      filter:
        query: "-@http.method:* @load_balancer.service_name:*"
      processors:
        - type: schema-processor
          name: Apply OCSF schema for 4001
          enabled: true
          mappers:
            - type: schema-category-mapper
              name: ocsf.activity_id
              categories:
                - filter:
                    query: "*"
                  name: Traffic
                  id: 6
              targets:
                name: ocsf.activity_name
                id: ocsf.activity_id
            - type: schema-category-mapper
              name: ocsf.severity_id
              categories:
                - filter:
                    query: "*"
                  name: Informational
                  id: 1
              targets:
                name: ocsf.severity
                id: ocsf.severity_id
            - type: schema-category-mapper
              name: ocsf.connection_info.direction_id
              categories:
                - filter:
                    query: "*"
                  name: Inbound
                  id: 1
              targets:
                name: ocsf.connection_info.direction
                id: ocsf.connection_info.direction_id
            - type: schema-remapper
              name: Map `network.client.ip` to `ocsf.src_endpoint.ip`
              sources:
                - network.client.ip
              target: ocsf.src_endpoint.ip
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `network.client.port` to `ocsf.src_endpoint.port`
              sources:
                - network.client.port
              target: ocsf.src_endpoint.port
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `load_balancer.service_name` to `ocsf.dst_endpoint.svc_name`
              sources:
                - load_balancer.service_name
              target: ocsf.dst_endpoint.svc_name
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `network.bytes_written` to `ocsf.traffic.bytes`
              sources:
                - network.bytes_written
              target: ocsf.traffic.bytes
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `date_access` to `ocsf.time`
              sources:
                - date_access
              target: ocsf.time
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `ocsf.metadata.product.name` to `ocsf.metadata.product.name`
              sources:
                - ocsf.metadata.product.name
              target: ocsf.metadata.product.name
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `ocsf.metadata.product.vendor_name` to `ocsf.metadata.product.vendor_name`
              sources:
                - ocsf.metadata.product.vendor_name
              target: ocsf.metadata.product.vendor_name
              preserveSource: true
              overrideOnConflict: true
          schema:
            schemaType: ocsf
            version: 1.5.0
            className: Network Activity
            classUid: 4001
            extensions: []
            profiles: []
    - type: pipeline
      name: OCSF sub pipeline for class HTTP Activity [4002]
      enabled: true
      ocsf:
        isOcsf: true
      filter:
        query: "@http.method:* OR @haproxy.mode:HTTP"
      processors:
        - type: grok-parser
          name: Parse `ocsf.http_request.url.query_string` from `http.url`
          enabled: true
          source: http.url
          samples:
            - /api/v1/check_run/?api_key=test
          grok:
            supportRules: ""
            matchRules: |
              extract_query_string %{regex("[^?]+")}\?%{regex(".*"):ocsf.http_request.url.query_string}
        - type: string-builder-processor
          name: Add ocsf.connection_info.protocol_name
          enabled: true
          template: "HTTP"
          target: ocsf.connection_info.protocol_name
          replaceMissing: false
        - type: schema-processor
          name: Apply OCSF schema for 4002
          enabled: true
          mappers:
            - type: schema-category-mapper
              name: ocsf.activity_id
              categories:
                - filter:
                    query: "@http.method:CONNECT OR @haproxy.mode:HTTP"
                  name: Connect
                  id: 1
                - filter:
                    query: "@http.method:DELETE"
                  name: Delete
                  id: 2
                - filter:
                    query: "@http.method:GET"
                  name: Get
                  id: 3
                - filter:
                    query: "@http.method:HEAD"
                  name: Head
                  id: 4
                - filter:
                    query: "@http.method:OPTIONS"
                  name: Options
                  id: 5
                - filter:
                    query: "@http.method:POST"
                  name: Post
                  id: 6
                - filter:
                    query: "@http.method:PUT"
                  name: Put
                  id: 7
                - filter:
                    query: "@http.method:TRACE"
                  name: Trace
                  id: 8
                - filter:
                    query: "@http.method:PATCH"
                  name: Patch
                  id: 9
                - filter:
                    query: "@http.method:*"
                  name: Other
                  id: 99
              targets:
                name: ocsf.activity_name
                id: ocsf.activity_id
            - type: schema-category-mapper
              name: ocsf.severity_id
              categories:
                - filter:
                    query: "*"
                  name: Informational
                  id: 1
              targets:
                name: ocsf.severity
                id: ocsf.severity_id
            - type: schema-category-mapper
              name: ocsf.connection_info.direction_id
              categories:
                - filter:
                    query: "*"
                  name: Inbound
                  id: 1
              targets:
                name: ocsf.connection_info.direction
                id: ocsf.connection_info.direction_id
            - type: schema-category-mapper
              name: ocsf.status_id
              categories:
                - filter:
                    query: "@http.status_code:[200 TO 399]"
                  name: Success
                  id: 1
                - filter:
                    query: "@http.status_code:[400 TO 599]"
                  name: Failure
                  id: 2
                - filter:
                    query: "*"
                  name: Unknown
                  id: 99
              targets:
                name: ocsf.status
                id: ocsf.status_id
            - type: schema-remapper
              name: Map `network.client.ip` to `ocsf.src_endpoint.ip`
              sources:
                - network.client.ip
              target: ocsf.src_endpoint.ip
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `network.client.port` to `ocsf.src_endpoint.port`
              sources:
                - network.client.port
              target: ocsf.src_endpoint.port
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `network.destination.ip` to `ocsf.dst_endpoint.ip`
              sources:
                - network.destination.ip
              target: ocsf.dst_endpoint.ip
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `network.destination.port` to `ocsf.dst_endpoint.port`
              sources:
                - network.destination.port
              target: ocsf.dst_endpoint.port
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `haproxy.frontend_name` to `ocsf.app_name`
              sources:
                - haproxy.frontend_name
              target: ocsf.app_name
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `http.method` to `ocsf.http_request.http_method`
              sources:
                - http.method
              target: ocsf.http_request.http_method
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `ocsf.http_request.url.url_string` to `ocsf.http_request.url.url_string`
              sources:
                - ocsf.http_request.url.url_string
              target: ocsf.http_request.url.url_string
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `http.url` to `ocsf.http_request.url.url_string`
              sources:
                - http.url
              target: ocsf.http_request.url.url_string
              preserveSource: true
              overrideOnConflict: false
            - type: schema-remapper
              name: Map `http.url_details.path` to `ocsf.http_request.url.path`
              sources:
                - http.url_details.path
              target: ocsf.http_request.url.path
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `ocsf.http_request.url.query_string` to `ocsf.http_request.url.query_string`
              sources:
                - ocsf.http_request.url.query_string
              target: ocsf.http_request.url.query_string
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `http.version` to `ocsf.http_request.version`
              sources:
                - http.version
              target: ocsf.http_request.version
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `ocsf.connection_info.protocol_name` to `ocsf.connection_info.protocol_name`
              sources:
                - ocsf.connection_info.protocol_name
              target: ocsf.connection_info.protocol_name
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `http.version` to `ocsf.connection_info.protocol_ver`
              sources:
                - http.version
              target: ocsf.connection_info.protocol_ver
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `http.status_code` to `ocsf.http_response.code`
              sources:
                - http.status_code
              target: ocsf.http_response.code
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `http.status_category` to `ocsf.http_response.status`
              sources:
                - http.status_category
              target: ocsf.http_response.status
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `network.bytes_written` to `ocsf.traffic.bytes`
              sources:
                - network.bytes_written
              target: ocsf.traffic.bytes
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `duration` to `ocsf.duration`
              sources:
                - duration
              target: ocsf.duration
              preserveSource: true
              targetFormat: double
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `http.status_code` to `ocsf.status_code`
              sources:
                - http.status_code
              target: ocsf.status_code
              preserveSource: true
              targetFormat: string
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `date_access` to `ocsf.time`
              sources:
                - date_access
              target: ocsf.time
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `syslog.date` to `ocsf.time`
              sources:
                - syslog.date
              target: ocsf.time
              preserveSource: true
              overrideOnConflict: false
            - type: schema-remapper
              name: Map `ocsf.metadata.product.name` to `ocsf.metadata.product.name`
              sources:
                - ocsf.metadata.product.name
              target: ocsf.metadata.product.name
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `ocsf.metadata.product.vendor_name` to `ocsf.metadata.product.vendor_name`
              sources:
                - ocsf.metadata.product.vendor_name
              target: ocsf.metadata.product.vendor_name
              preserveSource: true
              overrideOnConflict: true
          schema:
            schemaType: ocsf
            version: 1.5.0
            className: HTTP Activity
            classUid: 4002
            extensions: []
            profiles: []
