id: "apache"
tests:
 -
  sample: "127.0.0.1 - frank [13/Jul/2016:10:55:36 +0000] \"GET /apache_pb.gif HTTP/1.0\" 200 2326"
  result:
    custom:
      date_access: 1468407336000
      http:
        auth: "frank"
        method: "GET"
        status_category: "OK"
        status_code: 200
        url: "/apache_pb.gif"
        url_details:
          path: "/apache_pb.gif"
        version: "1.0"
      network:
        bytes_written: 2326
        client:
          ip: "127.0.0.1"
      ocsf:
        activity_id: 3
        activity_name: "Get"
        category_name: "Network Activity"
        category_uid: 4
        class_name: "HTTP Activity"
        class_uid: 4002
        http_request:
          http_method: "GET"
          url:
            path: "/apache_pb.gif"
        http_response:
          code: 200
          status: "OK"
        metadata:
          event_code: "GET"
          product:
            name: "Apache HTTP Server"
            vendor_name: "Apache Software Foundation"
          version: "1.5.0"
        severity: "Informational"
        severity_id: 1
        src_endpoint:
          ip: "127.0.0.1"
        status: "Success"
        status_code: "200"
        status_id: 1
        time: 1468407336000
    message: "127.0.0.1 - frank [13/Jul/2016:10:55:36 +0000] \"GET /apache_pb.gif HTTP/1.0\" 200 2326"
    status: "ok"
    tags:
     - "source:LOGS_SOURCE"
    timestamp: 1468407336000
 -
  sample: "192.0.2.1 - Ultan [07/Mar/2004:16:43:54 -0800] \"GET /unencrypted_password_list?foo=bar HTTP/1.1\" 404 9001 \"http://passwords.hackz0r\" \"Mozilla/4.08 [en] (Win95)\""
  result:
    custom:
      date_access: 1078706634000
      http:
        auth: "Ultan"
        method: "GET"
        referer: "http://passwords.hackz0r"
        status_category: "warning"
        status_code: 404
        url: "/unencrypted_password_list?foo=bar"
        url_details:
          path: "/unencrypted_password_list"
          queryString:
            foo: "bar"
        useragent: "Mozilla/4.08 [en] (Win95)"
        useragent_details:
          browser:
            family: "Other"
          device:
            category: "Desktop"
            family: "Other"
          os:
            family: "Windows"
            major: "95"
        version: "1.1"
      network:
        bytes_written: 9001
        client:
          ip: "192.0.2.1"
      ocsf:
        activity_id: 3
        activity_name: "Get"
        category_name: "Network Activity"
        category_uid: 4
        class_name: "HTTP Activity"
        class_uid: 4002
        http_request:
          http_method: "GET"
          referrer: "http://passwords.hackz0r"
          url:
            path: "/unencrypted_password_list"
            query_string: "foo=bar"
          user_agent: "Mozilla/4.08 [en] (Win95)"
        http_response:
          code: 404
          status: "warning"
        metadata:
          event_code: "GET"
          product:
            name: "Apache HTTP Server"
            vendor_name: "Apache Software Foundation"
          version: "1.5.0"
        severity: "Informational"
        severity_id: 1
        src_endpoint:
          ip: "192.0.2.1"
          os:
            name: "Windows"
            type: "Windows"
            type_id: 100
        status: "Failure"
        status_code: "404"
        status_id: 2
        time: 1078706634000
    message: "192.0.2.1 - Ultan [07/Mar/2004:16:43:54 -0800] \"GET /unencrypted_password_list?foo=bar HTTP/1.1\" 404 9001 \"http://passwords.hackz0r\" \"Mozilla/4.08 [en] (Win95)\""
    status: "warn"
    tags:
     - "source:LOGS_SOURCE"
    timestamp: 1078706634000