# bypass-global-missing-date-remapper-checks
id: sshd
metric_id: ssh
backend_only: false
facets:
  - groups:
      - Web Access
    name: Client IP
    path: network.client.ip
    source: log
  - groups:
      - Web Access
    name: Client Port
    path: network.client.port
    source: log
  - groups:
      - System
    name: User
    path: system.user
    source: log
  - groups:
      - System
    name: Action
    path: system.action
    source: log
  - groups:
      - OCSF
    name: Activity ID
    path: ocsf.activity_id
    source: log
  - groups:
      - OCSF
    name: Category ID
    path: ocsf.category_uid
    source: log
  - groups:
      - OCSF
    name: Category
    path: ocsf.category_name
    source: log
  - groups:
      - OCSF
    name: Class ID
    path: ocsf.class_uid
    source: log
  - groups:
      - OCSF
    name: Class
    path: ocsf.class_name
    source: log
  - groups:
      - OCSF
    name: Target Name
    path: ocsf.user.name
    source: log
  - groups:
      - OCSF
    name: Source IP Address
    path: ocsf.src_endpoint.ip
    source: log
  - groups:
      - OCSF
    name: Status
    path: ocsf.status
    source: log
  - groups:
      - OCSF
    name: Status ID
    path: ocsf.status_id
    source: log
pipeline:
  type: pipeline
  name: Sshd
  enabled: true
  filter:
    query: source:sshd
  processors:
    - type: grok-parser
      name: Parsing sshd logs
      enabled: true
      source: message
      grok:
        supportRules: |
          _client_ip %{ipOrHost:network.client.ip}
          _client_port %{port:network.client.port}
          _auth %{notSpace:system.user:nullIf("-")}
          _sshd_details logname=(?>%{notSpace:system.logname}|) uid=%{integer:system.uid} euid=%{integer:system.euid} tty=%{notSpace:system.tty} ruser=(?>%{notSpace:system.ruser}|) rhost=%{_client_ip}  user=%{_auth}
        matchRules: |
          sshd.logins.pwd %{regex("Accepted|Failed"):system.action} %{regex("password"):system.type} for %{_auth} from %{_client_ip} port %{_client_port} ssh2

          sshd.logins.invaliduser %{regex("Accepted|Failed"):system.action} %{regex("password"):system.type} for invalid user %{_auth} from %{_client_ip} port %{_client_port} ssh2

          sshd.logins.key.success %{regex("Accepted"):system.action} %{regex("publickey"):system.type} for %{_auth} from %{_client_ip} port %{_client_port} ssh2(: %{notSpace:system.algorithm} %{notSpace:system.key})?

          sshd.disconnect (error: )?Received %{regex("disconnect"):system.action} from %{_client_ip}: %{greedyData:system.type}

          sshd.hostkey (error: )?%{regex("Could not load host key"):system.action}: %{notSpace:system.key}

          sshd.cnx.closed.preauth %{regex("Connection closed"):system.action} by %{_client_ip}%{greedyData}

          sshd.session pam_unix\(sshd\:session\)\: %{regex("(session opened)|(session closed)"):system.action} for user %{_auth}.*

          sshd.session.starting %{regex("Starting session"):system.action}: %{notSpace:system.type} on %{notSpace:system.tty} for %{_auth} from %{_client_ip} port %{_client_port} id %{integer:system.session_id}

          sshd.session.close %{regex("Close session"):system.action}: user %{_auth} from %{_client_ip} port %{_client_port} id %{integer:system.session_id}

          sshd.auth pam_unix\(sshd\:auth\)\: %{regex("authentication failure"):system.action}; %{_sshd_details}

          sshd.auth_2 PAM %{integer} more %{regex("(authentication failure|authentication failures)"):system.action}; %{_sshd_details}

          sshd.invalid.user %{regex("Invalid user"):system.action} %{_auth}%{greedyData} from %{_client_ip}

          sshd.identification %{regex("Did not receive identification string"):system.action} from %{_client_ip}

          sshd.reversemappingchecking.failed %{regex("reverse mapping checking"):system.action} getaddrinfo for %{notSpace} \[%{_client_ip}\] failed%{greedyData}
      samples:
        - 'pam_unix(sshd:session): session closed for user marc.szalkiewicz'
        - 'Accepted publickey for toptop from 172.22.179.72 port 58599 ssh2: RSA 01:fa:c1:75:ee:fbxxxx:xxxxx'
        - 'Received disconnect from 172.22.179.72: 11: disconnected by user'
    - type: pipeline
      name: OCSF pipeline for SSH Authentication [3002]
      enabled: true
      ocsf:
        isOcsf: true
      filter:
        query: "source:sshd @system.action:* @system.user:*"
      processors:
        - type: string-builder-processor
          name: Add ocsf.metadata.product.name
          enabled: true
          template: "OpenSSH"
          target: ocsf.metadata.product.name
          replaceMissing: false
        - type: string-builder-processor
          name: Add ocsf.metadata.product.vendor_name
          enabled: true
          template: "OpenBSD"
          replaceMissing: false
          target: ocsf.metadata.product.vendor_name
        - type: schema-processor
          name: Apply OCSF schema for 3002
          enabled: true
          mappers:
            - type: schema-remapper
              name: Map `ocsf.metadata` to `ocsf.metadata`
              sources:
                - ocsf.metadata
              target: ocsf.metadata
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `system.action` to `ocsf.metadata.event_code`
              sources:
                - system.action
              target: ocsf.metadata.event_code
              preserveSource: true
              overrideOnConflict: true
            - type: schema-category-mapper
              name: ocsf.activity_id
              categories:
                - filter:
                    query: '@system.action:(Accepted OR Failed OR "Starting session" OR "session opened")'
                  name: Logon
                  id: 1
                - filter:
                    query: '@system.action:("session closed" OR "Close session")'
                  name: Logoff
                  id: 2
                - filter:
                    query: '@system.action:*'
                  name: Other
                  id: 99
              targets:
                name: ocsf.activity_name
                id: ocsf.activity_id
            - type: schema-category-mapper
              name: ocsf.severity_id
              categories:
                - filter:
                    query: "@system.action:*"
                  name: Informational
                  id: 1
              targets:
                name: ocsf.severity
                id: ocsf.severity_id
            - type: schema-remapper
              name: Map `system.user` to `ocsf.user.name`
              sources:
                - system.user
              target: ocsf.user.name
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `system.user` to `ocsf.actor.user.name`
              sources:
                - system.user
              target: ocsf.actor.user.name
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `network.client.ip` to `ocsf.src_endpoint.ip`
              sources:
                - network.client.ip
              target: ocsf.src_endpoint.ip
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `network.client.port` to `ocsf.src_endpoint.port`
              sources:
                - network.client.port
              target: ocsf.src_endpoint.port
              targetType: integer
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `journald._HOSTNAME` to `ocsf.dst_endpoint.hostname`
              sources:
                - journald._HOSTNAME
              target: ocsf.dst_endpoint.hostname
              preserveSource: true
              overrideOnConflict: true
            - type: schema-remapper
              name: Map `journald._SOURCE_REALTIME_TIMESTAMP` to `ocsf.time`
              sources:
                - journald._SOURCE_REALTIME_TIMESTAMP
              target: ocsf.time
              preserveSource: true
              overrideOnConflict: true
            - type: schema-category-mapper
              name: ocsf.status_id
              categories:
                - filter:
                    query: '@system.action:(Accepted OR "Starting session" OR "Close session" OR "session opened" OR "session closed")'
                  name: Success
                  id: 1
                - filter:
                    query: '@system.action:(Failed OR "authentication failure" OR "authentication failures")'
                  name: Failure
                  id: 2
                - filter:
                    query: "@system.action:*"
                  name: Other
                  id: 99
              targets:
                name: ocsf.status
                id: ocsf.status_id
          schema:
            schemaType: ocsf
            version: 1.5.0
            className: Authentication
            classUid: 3002
            extensions: []
            profiles: []
