id: "pan.firewall"
tests:
 -
  sample: "timestamp=2019/05/06 16:43:53, serial=001801010877, type=AUTHENTICATION, subtype=virus, vsys=testVM,  network.client.ip=10.2.75.414, usr.id=Jaydeep,  normalize_user=,  object=,  authpolicy=authpolicy, repeatcnt=1, authid=68376, vendor=Symentic, logset=testForwarder, serverprofile=serverprofile, message=thisIsSampleMessage, \tclienttype=securityApp, evt.name=alert, factorno=687383, seqno=486021038, actionflags=0xa0000 00000000000, vsys_name=JVM, device_name=tab,  vsys_id=786,\tauthproto=authproto"
  result:
    custom:
      actionflags: "0xa0000 00000000000"
      authid: 68376
      authpolicy: "authpolicy"
      authproto: "authproto"
      clienttype: "securityApp"
      device_name: "tab"
      evt:
        name: "alert"
      factorno: 687383
      logset: "testForwarder"
      message: "thisIsSampleMessage"
      network:
        client:
          geoip:
            invalidAddress: "10.2.75.414"
          ip: "10.2.75.414"
      repeatcnt: 1
      seqno: 486021038
      serial: "001801010877"
      serverprofile: "serverprofile"
      subtype: "virus"
      type: "AUTHENTICATION"
      usr:
        id: "Jaydeep"
      vendor: "Symentic"
      vsys: "testVM"
      vsys_id: 786
      vsys_name: "JVM"
    message: "timestamp=2019/05/06 16:43:53, serial=001801010877, type=AUTHENTICATION, subtype=virus, vsys=testVM,  network.client.ip=10.2.75.414, usr.id=Jaydeep,  normalize_user=,  object=,  authpolicy=authpolicy, repeatcnt=1, authid=68376, vendor=Symentic, logset=testForwarder, serverprofile=serverprofile, message=thisIsSampleMessage, \tclienttype=securityApp, evt.name=alert, factorno=687383, seqno=486021038, actionflags=0xa0000 00000000000, vsys_name=JVM, device_name=tab,  vsys_id=786,\tauthproto=authproto"
    tags:
     - "source:LOGS_SOURCE"
    timestamp: 1
 -
  sample: "timestamp=2025/08/22 13:53:17, serial=023001016134, type=THREAT, subtype=url, time_generated=2025/08/22 13:53:17, network.client.ip=10.70.73.88, network.destination.ip=52.1.12.13, natsrc=188.8.8.88, natdst=52.1.12.13, rule=Regra wifi grupolm para internet, usr.id=, dstuser=, app=ssl, vsys=vsys1, from=wifigrupolm, to=external, inbound_if=ae1.4000, outbound_if=ae1.53, logset=default, sessionid=264167, repeatcnt=1, network.client.port=51342, network.destination.port=443, natsport=53411, natdport=443, flags=0x42b400, proto=tcp, evt.name=alert, misc=excel-telemetry.officeapps.live.com/, threatid=(9999), category=computer-and-internet-info, severity=informational, direction=client-to-server, seqno=7506906696836281042, actionflags=0x0, network.client.geoip.country.name=10.0.0.0-10.255.255.255, dstloc=Mexico, contenttype=, pcap_id=0, filedigest=, cloud=, url_idx=0, http.useragent=, filetype=, xff=, referer=, sender=, subject=, recipient=, reportid=0, vsys_name=, device_name=test_device2, src_uuid=, dst_uuid=, http_method=, tunnel_id=N/A_id, imsi=0, monitortag=, imei=, parent_session_id=0, parent_start_time=, tunnel=N/A, thr_category=N/A, contentver=AppThreat-0-0, assoc_id=0, ppid=4294967295, http_headers=, url_category_list=computer-and-internet-info,low-risk, rule_uuid=c7ee18cf-77b2-4503-9c8e-bfc799dh4c43, http2_connection=0, dynusergroup_name=, xff_ip=, src_osfamily=, src_osversion=, src_host=, src_mac=, dst_osfamily=, dst_osversion=, dst_host=, dst_mac=, container_id=, pod_namespace=, pod_name=, src_edl=, dst_edl=, hostid=, serialnumber=, domain_edl=, src_dag=, dst_dag=, partial_hash=0, high_res_timestamp=2025-08-22T13:53:18.014-03:00, reason=, justification="
  result:
    custom:
      actionflags: "0x0"
      app: "ssl"
      assoc_id: 0
      category: "computer-and-internet-info"
      contentver: "AppThreat-0-0"
      device_name: "test_device2"
      direction: "client-to-server"
      dstloc: "Mexico"
      evt:
        name: "alert"
      flags: "0x42b400"
      from: "wifigrupolm"
      http2_connection: 0
      imsi: 0
      inbound_if: "ae1.4000"
      logset: "default"
      natdport: 443
      natdst: "52.1.12.13"
      natsport: 53411
      natsrc: "188.8.8.88"
      network:
        client:
          geoip: {}
          ip: "10.70.73.88"
          port: 51342
        destination:
          ip: "52.1.12.13"
          port: 443
      ocsf:
        activity_id: 1
        activity_name: "Create"
        category_name: "Findings"
        category_uid: 2
        class_name: "Detection Finding"
        class_uid: 2004
        confidence_id: 0
        evidences:
         -
          actor:
            app_name: "ssl"
            session:
              uid: 264167
          file:
            type_id: "0"
          connection_info:
            direction_id: 0
            protocol_name: "tcp"
          src_endpoint:
            zone: "wifigrupolm"
            port: 51342
            ip: "10.70.73.88"
          dst_endpoint:
            zone: "external"
            port: 443
            ip: "52.1.12.13"
          device:
            type_id: 1
            name: "test_device2"
        finding_info:
          analytic:
            category: "url"
            name: "Regra wifi grupolm para internet"
            type: "Rule"
            type_id: 1
            uid: "c7ee18cf-77b2-4503-9c8e-bfc799dh4c43"
          product:
            name: "Firewall"
            vendor_name: "Palo Alto"
          uid: 7506906696836281042
        is_alert: true
        metadata:
          product:
            name: "Firewall"
            uid: "23001016134"
            vendor_name: "Palo Alto"
          sequence: 7506906696836281042
          version: "1.5.0"
        severity: "Informational"
        severity_id: 1
        status: "New"
        status_id: 1
        type_uid: 200401
      outbound_if: "ae1.53"
      parent_session_id: 0
      partial_hash: 0
      pcap_id: 0
      ppid: 4294967295
      proto: "tcp"
      repeatcnt: 1
      reportid: 0
      rule: "Regra wifi grupolm para internet"
      rule_uuid: "c7ee18cf-77b2-4503-9c8e-bfc799dh4c43"
      seqno: 7506906696836281042
      serial: 23001016134
      sessionid: 264167
      severity: "informational"
      subtype: "url"
      to: "external"
      type: "THREAT"
      url_category_list: "computer-and-internet-info"
      url_idx: 0
      vsys: "vsys1"
    message: "timestamp=2025/08/22 13:53:17, serial=023001016134, type=THREAT, subtype=url, time_generated=2025/08/22 13:53:17, network.client.ip=10.70.73.88, network.destination.ip=52.1.12.13, natsrc=188.8.8.88, natdst=52.1.12.13, rule=Regra wifi grupolm para internet, usr.id=, dstuser=, app=ssl, vsys=vsys1, from=wifigrupolm, to=external, inbound_if=ae1.4000, outbound_if=ae1.53, logset=default, sessionid=264167, repeatcnt=1, network.client.port=51342, network.destination.port=443, natsport=53411, natdport=443, flags=0x42b400, proto=tcp, evt.name=alert, misc=excel-telemetry.officeapps.live.com/, threatid=(9999), category=computer-and-internet-info, severity=informational, direction=client-to-server, seqno=7506906696836281042, actionflags=0x0, network.client.geoip.country.name=10.0.0.0-10.255.255.255, dstloc=Mexico, contenttype=, pcap_id=0, filedigest=, cloud=, url_idx=0, http.useragent=, filetype=, xff=, referer=, sender=, subject=, recipient=, reportid=0, vsys_name=, device_name=test_device2, src_uuid=, dst_uuid=, http_method=, tunnel_id=N/A_id, imsi=0, monitortag=, imei=, parent_session_id=0, parent_start_time=, tunnel=N/A, thr_category=N/A, contentver=AppThreat-0-0, assoc_id=0, ppid=4294967295, http_headers=, url_category_list=computer-and-internet-info,low-risk, rule_uuid=c7ee18cf-77b2-4503-9c8e-bfc799dh4c43, http2_connection=0, dynusergroup_name=, xff_ip=, src_osfamily=, src_osversion=, src_host=, src_mac=, dst_osfamily=, dst_osversion=, dst_host=, dst_mac=, container_id=, pod_namespace=, pod_name=, src_edl=, dst_edl=, hostid=, serialnumber=, domain_edl=, src_dag=, dst_dag=, partial_hash=0, high_res_timestamp=2025-08-22T13:53:18.014-03:00, reason=, justification="
    tags:
     - "source:LOGS_SOURCE"
    timestamp: 1
 -
  sample: "timestamp=2025/08/25 17:15:02, serial=023001016210, type=TRAFFIC, subtype=end, time_generated=2025/08/25 17:15:02, network.client.ip=10.160.20.45, network.destination.ip=192.168.1.1, natsrc=0.0.0.0, natdst=0.0.0.0, rule=allow vm new dc-1, usr.id=test_user, dstuser=, app=incomplete, vsys=vsys1, from=dcglobalprotect, to=dclan2lan, inbound_if=tunnel, outbound_if=ae1.190, logset=default, sessionid=136240, repeatcnt=1, network.client.port=59065, network.destination.port=8013, natsport=0, natdport=0, flags=0x19, proto=tcp, evt.name=allow, bytes=140, network.bytes_read=140, network.bytes_written=0, start=2025/08/25 17:14:58, elapsed=1, category=any, seqno=7519553924936159600, actionflags=0x0, network.client.geoip.country.name=10.0.0.0-10.255.255.255, dstloc=192.168.0.0-192.168.255.255, pkts_sent=2, pkts_received=0, session_end_reason=aged-out, device_name=test_device, action_source=from-policy, src_uuid=, dst_uuid=, tunnelid=0, imsi=0, monitortag=, imei=, parent_session_id=0, parent_start_time=, tunnel=N/A, assoc_id=0, chunks=0, chunks_sent=0, chunks_received=0"
  result:
    custom:
      action_source: "from-policy"
      actionflags: "0x0"
      app: "incomplete"
      assoc_id: 0
      bytes: 140
      category: "any"
      chunks: 0
      chunks_received: 0
      chunks_sent: 0
      device_name: "test_device"
      dstloc: "192.168.0.0-192.168.255.255"
      elapsed: 1
      evt:
        name: "allow"
      flags: "0x19"
      from: "dcglobalprotect"
      imsi: 0
      inbound_if: "tunnel"
      logset: "default"
      natdport: 0
      natdst: "0.0.0.0"
      natsport: 0
      natsrc: "0.0.0.0"
      network:
        bytes_read: 140
        bytes_written: 0
        client:
          geoip: {}
          ip: "10.160.20.45"
          port: 59065
        destination:
          ip: "192.168.1.1"
          port: 8013
      ocsf:
        activity_id: 2
        activity_name: "end"
        category_uid: 4
        class_name: "Network Activity"
        class_uid: 4001
        connection_info:
          direction_id: 0
          protocol_name: "tcp"
          session:
            uid: "136240"
        dst_endpoint:
          ip: "192.168.1.1"
          port: 8013
        metadata:
          product:
            name: "Firewall"
            uid: "23001016210"
            vendor_name: "Palo Alto"
          sequence: 7519553924936159600
          version: "1.5.0"
        severity: "informational"
        severity_id: 1
        src_endpoint:
          ip: "10.160.20.45"
          port: 59065
        traffic:
          bytes: 140
          chunks: 0
          chunks_in: 0
          chunks_out: 0
          packets_in: 0
          packets_out: 2
        type_name: "Network Activity: Close"
        type_uid: 400102
      outbound_if: "ae1.190"
      parent_session_id: 0
      pkts_received: 0
      pkts_sent: 2
      proto: "tcp"
      repeatcnt: 1
      rule: "allow vm new dc-1"
      seqno: 7519553924936159600
      serial: 23001016210
      session_end_reason: "aged-out"
      sessionid: 136240
      subtype: "end"
      to: "dclan2lan"
      tunnelid: 0
      type: "TRAFFIC"
      usr:
        id: "test_user"
      vsys: "vsys1"
    message: "timestamp=2025/08/25 17:15:02, serial=023001016210, type=TRAFFIC, subtype=end, time_generated=2025/08/25 17:15:02, network.client.ip=10.160.20.45, network.destination.ip=192.168.1.1, natsrc=0.0.0.0, natdst=0.0.0.0, rule=allow vm new dc-1, usr.id=test_user, dstuser=, app=incomplete, vsys=vsys1, from=dcglobalprotect, to=dclan2lan, inbound_if=tunnel, outbound_if=ae1.190, logset=default, sessionid=136240, repeatcnt=1, network.client.port=59065, network.destination.port=8013, natsport=0, natdport=0, flags=0x19, proto=tcp, evt.name=allow, bytes=140, network.bytes_read=140, network.bytes_written=0, start=2025/08/25 17:14:58, elapsed=1, category=any, seqno=7519553924936159600, actionflags=0x0, network.client.geoip.country.name=10.0.0.0-10.255.255.255, dstloc=192.168.0.0-192.168.255.255, pkts_sent=2, pkts_received=0, session_end_reason=aged-out, device_name=test_device, action_source=from-policy, src_uuid=, dst_uuid=, tunnelid=0, imsi=0, monitortag=, imei=, parent_session_id=0, parent_start_time=, tunnel=N/A, assoc_id=0, chunks=0, chunks_sent=0, chunks_received=0"
    tags:
     - "source:LOGS_SOURCE"
    timestamp: 1