id: ping-one-aic
metric_id: ping-one-aic
backend_only: false
facets:
  - groups:
      - Event
    name: Event Name
    path: evt.name
    source: log
  - groups:
      - Event
    name: Event Outcome
    path: evt.outcome
    source: log
  - groups:
      - Geoip
    name: City Name
    path: network.client.geoip.city.name
    source: log
  - groups:
      - Geoip
    name: Continent Code
    path: network.client.geoip.continent.code
    source: log
  - groups:
      - Geoip
    name: Continent Name
    path: network.client.geoip.continent.name
    source: log
  - groups:
      - Geoip
    name: Country ISO Code
    path: network.client.geoip.country.iso_code
    source: log
  - groups:
      - Geoip
    name: Country Name
    path: network.client.geoip.country.name
    source: log
  - groups:
      - Geoip
    name: Subdivision ISO Code
    path: network.client.geoip.subdivision.iso_code
    source: log
  - groups:
      - Geoip
    name: Subdivision Name
    path: network.client.geoip.subdivision.name
    source: log
  - groups:
      - Web Access
    name: Client IP
    path: network.client.ip
    source: log
  - groups:
      - User
    name: User ID
    path: usr.id
    source: log
  - description: ''
    facetType: list
    groups:
      - PingOne Advanced Identity Cloud
    name: Journey
    path: payload.entries.info.treeName
    source: log
    type: string
  - description: ''
    facetType: list
    groups:
      - PingOne Advanced Identity Cloud
    name: Realm
    path: payload.realm
    source: log
    type: string
pipeline:
  type: pipeline
  name: PingOne Advanced Identity Cloud
  enabled: true
  filter:
    query: source:ping-one-aic
  processors:
    - type: date-remapper
      name: Define `timestamp` as the official date of the log
      enabled: true
      sources:
        - timestamp
    - type: attribute-remapper
      name: Map `payload.eventName` to `evt.name`
      enabled: true
      sources:
        - payload.eventName
      sourceType: attribute
      target: evt.name
      targetType: attribute
      preserveSource: true
      overrideOnConflict: false
    - type: array-processor
      name: Select `info.nodeOutcome` from `payload.entries` array
      enabled: true
      operation:
        source: payload.entries
        target: info.nodeOutcome
        filter: "info.nodeOutcome:* "
        valueToExtract: info.nodeOutcome
        type: select
    - type: attribute-remapper
      name: Map `payload.result`, `payload.status`, `info.nodeOutcome`  to
        `evt.outcome`
      enabled: true
      sources:
        - payload.result
        - payload.status
        - info.nodeOutcome
      sourceType: attribute
      target: evt.outcome
      targetType: attribute
      targetFormat: string
      preserveSource: true
      overrideOnConflict: false
    - type: attribute-remapper
      name: Map `source` to `evt.category`
      enabled: true
      sources:
        - source
      sourceType: attribute
      target: evt.category
      targetType: attribute
      preserveSource: true
      overrideOnConflict: false
    - type: array-processor
      name: Select `info.ipAddress` from `payload.entries` array
      enabled: true
      operation:
        source: payload.entries
        target: info.ipAddress
        filter: "info.ipAddress:* "
        valueToExtract: info.ipAddress
        type: select
    - type: array-processor
      name: Select `info.nodeType` from `payload.entries` array
      enabled: true
      operation:
        source: payload.entries
        target: info.nodeType
        filter: "info.nodeType:* "
        valueToExtract: info.nodeType
        type: select
    - type: array-processor
      name: Select `info.treeName` from `payload.entries` array
      enabled: true
      operation:
        source: payload.entries
        target: info.treeName
        filter: "info.treeName:* "
        valueToExtract: info.treeName
        type: select
    - type: string-builder-processor
      name: Map `payload.principal[0]` to `info.principal`
      enabled: true
      template: "%{payload.principal}"
      target: info.principal
      replaceMissing: false
    - type: attribute-remapper
      name: Map `info.principal`, `payload.userId` to `usr.id`
      enabled: true
      sources:
        - info.principal
        - payload.userId
      sourceType: attribute
      target: usr.id
      targetType: attribute
      preserveSource: true
      overrideOnConflict: false
    - type: attribute-remapper
      name: Map `payload.client.ip`, `info.ipAddress` to `network.client.ip`
      enabled: true
      sources:
        - payload.client.ip
        - info.ipAddress
      sourceType: attribute
      target: network.client.ip
      targetType: attribute
      preserveSource: true
      overrideOnConflict: false
    - type: geo-ip-parser
      name: GeoIP Parser
      enabled: true
      sources:
        - network.client.ip
      target: network.client.geoip
      ip_processing_behavior: do-nothing
    - type: status-remapper
      name: Define `payload.level` as the status of the log
      enabled: true
      sources:
        - payload.level
    - type: pipeline
      name: PingOne AIC OCSF pre transformations
      enabled: true
      ocsf:
        isOcsf: true
      filter:
        query: "*"
      processors:
        - type: string-builder-processor
          name: Add product name
          enabled: true
          template: PingOne Advanced Identity Cloud
          target: ocsf.metadata.product.name
          replaceMissing: false
        - type: string-builder-processor
          name: Add product vendor
          enabled: true
          template: Ping Identity
          target: ocsf.metadata.product.vendor_name
          replaceMissing: false
        - type: grok-parser
          name: Parsing timestamp
          enabled: true
          source: timestamp
          samples:
            - 2024-08-13T15:58:20.353Z
            - 2024-08-13T15:58:20.353123Z
          grok:
            supportRules: ""
            matchRules: >
              parsing_time %{date("yyyy-MM-dd'T'HH:mm:ss.SSSSSSSSSZ"):ocsf.time}

              parsing_time_1 %{date("yyyy-MM-dd'T'HH:mm:ss.SSSSSSSSZ"):ocsf.time}

              parsing_time_2 %{date("yyyy-MM-dd'T'HH:mm:ss.SSSSSSSZ"):ocsf.time}

              parsing_time_3 %{date("yyyy-MM-dd'T'HH:mm:ss.SSSSSSZ"):ocsf.time}

              parsing_time_4 %{date("yyyy-MM-dd'T'HH:mm:ss.SSSSSZ"):ocsf.time}

              parsing_time_5 %{date("yyyy-MM-dd'T'HH:mm:ss.SSSSZ"):ocsf.time}

              parsing_time_6 %{date("yyyy-MM-dd'T'HH:mm:ss.SSSZ"):ocsf.time}

              parsing_time_7 %{date("yyyy-MM-dd'T'HH:mm:ss.SSZ"):ocsf.time}

              parsing_time_8 %{date("yyyy-MM-dd'T'HH:mm:ssZ"):ocsf.time}
        - type: attribute-remapper
          name: Map `info.treeName`, `info.nodeType`, `payload.eventName` to
            `ocsf.metadata.event_code`
          enabled: true
          sources:
            - info.treeName
            - info.nodeType
            - payload.eventName
          sourceType: attribute
          target: ocsf.metadata.event_code
          targetType: attribute
          preserveSource: true
          overrideOnConflict: false
        - type: attribute-remapper
          name: Map `payload._id` to `ocsf.metadata.uid`
          enabled: true
          sources:
            - payload._id
          sourceType: attribute
          target: ocsf.metadata.uid
          targetType: attribute
          preserveSource: true
          overrideOnConflict: false
        - type: attribute-remapper
          name: Map `payload.transactionId` to `ocsf.metadata.correlation_uid`
          enabled: true
          sources:
            - payload.transactionId
          sourceType: attribute
          target: ocsf.metadata.correlation_uid
          targetType: attribute
          preserveSource: true
          overrideOnConflict: false
        - type: attribute-remapper
          name: Map `payload.result`, `payload.status`, `info.nodeOutcome`  to
            `ocsf.status`
          enabled: true
          sources:
            - payload.result
            - payload.status
            - info.nodeOutcome
          sourceType: attribute
          target: ocsf.status
          targetType: attribute
          preserveSource: true
          overrideOnConflict: false
        - type: category-processor
          name: OCSF - status_id mapping
          enabled: true
          categories:
            - filter:
                query: "@ocsf.status:(true OR TRUE OR SUCCESS OR SUCCESSFUL)"
              name: "1"
            - filter:
                query: "@ocsf.status:(false OR FALSE OR FAILED)"
              name: "2"
            - filter:
                query: "@ocsf.status:*"
              name: "99"
          target: ocsf.status_id
        - type: category-processor
          name: OCSF - status mapping
          enabled: true
          categories:
            - filter:
                query: "@ocsf.status_id:1"
              name: Success
            - filter:
                query: "@ocsf.status_id:2"
              name: Failure
          target: ocsf.status
        - type: attribute-remapper
          name: Map `ocsf.status_id` to `ocsf.status_id`
          enabled: true
          sources:
            - ocsf.status_id
          sourceType: attribute
          target: ocsf.status_id
          targetType: attribute
          targetFormat: integer
          preserveSource: false
          overrideOnConflict: false
    - type: pipeline
      name: PingOne AIC OCSF sub pipeline for class Account Change [3001]
      enabled: true
      ocsf:
        isOcsf: true
      filter:
        query: "@source:idm-activity"
      processors:
        - type: string-builder-processor
          name: Add version
          enabled: true
          template: 1.5.0
          target: ocsf.metadata.version
          replaceMissing: false
        - type: string-builder-processor
          name: Add category uid
          enabled: true
          template: "3"
          target: ocsf.category_uid
          replaceMissing: false
        - type: string-builder-processor
          name: Add category name
          enabled: true
          template: Identity & Access Management
          target: ocsf.category_name
          replaceMissing: false
        - type: string-builder-processor
          name: Add class uid
          enabled: true
          template: "3001"
          target: ocsf.class_uid
          replaceMissing: false
        - type: string-builder-processor
          name: Add class name
          enabled: true
          template: Account Change
          target: ocsf.class_name
          replaceMissing: false
        - type: string-builder-processor
          name: Add severity
          enabled: true
          template: Informational
          target: ocsf.severity
          replaceMissing: false
        - type: string-builder-processor
          name: Add severity id
          enabled: true
          template: "1"
          target: ocsf.severity_id
          replaceMissing: false
        - type: attribute-remapper
          name: Map `payload.userId` to `ocsf.actor.user.uid`
          enabled: true
          sources:
            - payload.userId
          sourceType: attribute
          target: ocsf.actor.user.uid
          targetType: attribute
          preserveSource: true
          overrideOnConflict: false
        - type: category-processor
          name: activity_id
          enabled: true
          categories:
            - filter:
                query: "@payload.operation:CREATE @payload.objectId:managed/alpha_user/*"
              name: "1"
            - filter:
                query: "@payload.after.accountStatus:active
                  @payload.before.accountStatus:Inactive"
              name: "2"
            - filter:
                query: "@ocsf.metadata.event_code:*"
              name: "99"
            - filter:
                query: "@payload.after.accountStatus:Inactive
                  @payload.before.accountStatus:active"
              name: "5"
            - filter:
                query: "@payload.passwordChanged:true @payload.operation:PATCH"
              name: "3"
            - filter:
                query: "@payload.operation:DELETE @payload.objectId:managed/alpha_user/*"
              name: "6"
          target: ocsf.activity_id
        - type: attribute-remapper
          name: Map `ocsf.activity_id` to `ocsf.activity_id`
          enabled: true
          sources:
            - ocsf.activity_id
          sourceType: attribute
          target: ocsf.activity_id
          targetType: attribute
          targetFormat: integer
          preserveSource: false
          overrideOnConflict: false
        - type: attribute-remapper
          name: Map `ocsf.metadata.event_code` to `ocsf.activity_name`
          enabled: true
          sources:
            - ocsf.metadata.event_code
          sourceType: attribute
          target: ocsf.activity_name
          targetType: attribute
          preserveSource: true
          overrideOnConflict: false
        - type: category-processor
          name: activity_name
          enabled: true
          categories:
            - filter:
                query: "@ocsf.activity_id:1"
              name: Create
            - filter:
                query: "@ocsf.activity_id:2"
              name: Enable
            - filter:
                query: "@ocsf.activity_id:3"
              name: Password Change
            - filter:
                query: "@ocsf.activity_id:5"
              name: Disable
            - filter:
                query: "@ocsf.activity_id:6"
              name: Delete
          target: ocsf.activity_name
    - type: pipeline
      name: PingOne AIC OCSF sub pipeline for class Authentication [3002]
      enabled: true
      ocsf:
        isOcsf: true
      filter:
        query: "(@source:am-authentication (@evt.name:AM-TREE-LOGIN-COMPLETED OR
          @payload.entries.info.nodeType:(IdentityStoreDecisionNode OR
          DataStoreDecisionNode OR OneTimePasswordCollectorDecisionNode))) OR
          (@source:am-access AND @payload.http.request.path:*authorize)"
      processors:
        - type: string-builder-processor
          name: Add version
          enabled: true
          template: 1.5.0
          target: ocsf.metadata.version
          replaceMissing: false
        - type: string-builder-processor
          name: Add category uid
          enabled: true
          template: "3"
          target: ocsf.category_uid
          replaceMissing: false
        - type: string-builder-processor
          name: Add category name
          enabled: true
          template: Identity & Access Management
          target: ocsf.category_name
          replaceMissing: false
        - type: string-builder-processor
          name: Add class uid
          enabled: true
          template: "3002"
          target: ocsf.class_uid
          replaceMissing: false
        - type: string-builder-processor
          name: Add class name
          enabled: true
          template: Authentication
          target: ocsf.class_name
          replaceMissing: false
        - type: string-builder-processor
          name: Add severity
          enabled: true
          template: Informational
          target: ocsf.severity
          replaceMissing: false
        - type: string-builder-processor
          name: Add severity id
          enabled: true
          template: "1"
          target: ocsf.severity_id
          replaceMissing: false
        - type: attribute-remapper
          name: Map `info.principal` to `ocsf.user.name`
          enabled: true
          sources:
            - info.principal
          sourceType: attribute
          target: ocsf.user.name
          targetType: attribute
          preserveSource: true
          overrideOnConflict: false
        - type: attribute-remapper
          name: Map `payload.userId` to `ocsf.user.uid`
          enabled: true
          sources:
            - payload.userId
          sourceType: attribute
          target: ocsf.user.uid
          targetType: attribute
          preserveSource: true
          overrideOnConflict: false
        - type: attribute-remapper
          name: Map `info.ipAddress` to `ocsf.src_endpoint.ip`
          enabled: true
          sources:
            - info.ipAddress
          sourceType: attribute
          target: ocsf.src_endpoint.ip
          targetType: attribute
          preserveSource: true
          overrideOnConflict: false
        - type: attribute-remapper
          name: Map `info.principal` to `ocsf.actor.user.name`
          enabled: true
          sources:
            - info.principal
          sourceType: attribute
          target: ocsf.actor.user.name
          targetType: attribute
          preserveSource: true
          overrideOnConflict: false
        - type: attribute-remapper
          name: Map `payload.userId` to `ocsf.actor.user.uid`
          enabled: true
          sources:
            - payload.userId
          sourceType: attribute
          target: ocsf.actor.user.uid
          targetType: attribute
          preserveSource: true
          overrideOnConflict: false
        - type: category-processor
          name: activity_id
          enabled: true
          categories:
            - filter:
                query: "@ocsf.metadata.event_code:(Login OR FRLogin) OR
                  @payload.entries.info.nodeType:(IdentityStoreDecisionNode OR
                  DataStoreDecisionNode OR OneTimePasswordCollectorDecisionNode)
                  OR (@ocsf.metadata.event_code:AM-ACCESS-OUTCOME AND
                  @payload.http.request.path:*authorize)"
              name: "1"
            - filter:
                query: "@ocsf.metadata.event_code:AM-SESSION-DESTROYED"
              name: "2"
            - filter:
                query: "@ocsf.metadata.event_code:*"
              name: "99"
          target: ocsf.activity_id
        - type: attribute-remapper
          name: Map `ocsf.activity_id` to `ocsf.activity_id`
          enabled: true
          sources:
            - ocsf.activity_id
          sourceType: attribute
          target: ocsf.activity_id
          targetType: attribute
          targetFormat: integer
          preserveSource: false
          overrideOnConflict: false
        - type: attribute-remapper
          name: Map `ocsf.metadata.event_code` to `ocsf.activity_name`
          enabled: true
          sources:
            - ocsf.metadata.event_code
          sourceType: attribute
          target: ocsf.activity_name
          targetType: attribute
          preserveSource: true
          overrideOnConflict: false
        - type: category-processor
          name: activity_name
          enabled: true
          categories:
            - filter:
                query: "@ocsf.activity_id:1"
              name: Logon
            - filter:
                query: "@ocsf.activity_id:2"
              name: Logoff
          target: ocsf.activity_name
    - type: pipeline
      name: PingOne AIC OCSF sub pipeline for class Entity Management [3004]
      enabled: true
      ocsf:
        isOcsf: true
      filter:
        query: "@source:am-config @payload.eventName:AM-CONFIG-CHANGE"
      processors:
        - type: string-builder-processor
          name: Add version
          enabled: true
          template: 1.5.0
          target: ocsf.metadata.version
          replaceMissing: false
        - type: string-builder-processor
          name: Add category uid
          enabled: true
          template: "3"
          target: ocsf.category_uid
          replaceMissing: false
        - type: string-builder-processor
          name: Add category name
          enabled: true
          template: Identity & Access Management
          target: ocsf.category_name
          replaceMissing: false
        - type: string-builder-processor
          name: Add class uid
          enabled: true
          template: "3004"
          target: ocsf.class_uid
          replaceMissing: false
        - type: string-builder-processor
          name: Add class name
          enabled: true
          template: Entity Management
          target: ocsf.class_name
          replaceMissing: false
        - type: string-builder-processor
          name: Add severity
          enabled: true
          template: Informational
          target: ocsf.severity
          replaceMissing: false
        - type: string-builder-processor
          name: Add severity id
          enabled: true
          template: "1"
          target: ocsf.severity_id
          replaceMissing: false
        - type: attribute-remapper
          name: Map `payload.userId` to `ocsf.actor.user.uid`
          enabled: true
          sources:
            - payload.userId
          sourceType: attribute
          target: ocsf.actor.user.uid
          targetType: attribute
          preserveSource: true
          overrideOnConflict: false
        - type: attribute-remapper
          name: Map `payload.objectId` to `ocsf.entity.uid`
          enabled: true
          sources:
            - payload.objectId
          sourceType: attribute
          target: ocsf.entity.uid
          targetType: attribute
          preserveSource: true
          overrideOnConflict: false
        - type: category-processor
          name: activity_id
          enabled: true
          categories:
            - filter:
                query: "@payload.operation:CREATE"
              name: "1"
            - filter:
                query: "@payload.operation:UPDATE"
              name: "3"
            - filter:
                query: "@payload.operation:DELETE"
              name: "4"
            - filter:
                query: "@ocsf.metadata.event_code:*"
              name: "99"
          target: ocsf.activity_id
        - type: attribute-remapper
          name: Map `ocsf.activity_id` to `ocsf.activity_id`
          enabled: true
          sources:
            - ocsf.activity_id
          sourceType: attribute
          target: ocsf.activity_id
          targetType: attribute
          targetFormat: integer
          preserveSource: false
          overrideOnConflict: false
        - type: attribute-remapper
          name: Map `ocsf.metadata.event_code` to `ocsf.activity_name`
          enabled: true
          sources:
            - ocsf.metadata.event_code
          sourceType: attribute
          target: ocsf.activity_name
          targetType: attribute
          preserveSource: true
          overrideOnConflict: false
        - type: category-processor
          name: activity_name
          enabled: true
          categories:
            - filter:
                query: "@ocsf.activity_id:1"
              name: Create
            - filter:
                query: "@ocsf.activity_id:3"
              name: Update
            - filter:
                query: "@ocsf.activity_id:4"
              name: Delete
          target: ocsf.activity_name
    - type: pipeline
      name: OCSF post transformations
      enabled: true
      ocsf:
        isOcsf: true
      filter:
        query: "*"
      processors:
        - type: attribute-remapper
          name: Map `ocsf.class_uid` to `ocsf.class_uid`
          enabled: true
          sources:
            - ocsf.class_uid
          sourceType: attribute
          target: ocsf.class_uid
          targetType: attribute
          targetFormat: integer
          preserveSource: false
          overrideOnConflict: false
        - type: attribute-remapper
          name: Map `ocsf.activity_id` to `ocsf.activity_id`
          enabled: true
          sources:
            - ocsf.activity_id
          sourceType: attribute
          target: ocsf.activity_id
          targetType: attribute
          targetFormat: integer
          preserveSource: false
          overrideOnConflict: false
        - type: attribute-remapper
          name: Map `ocsf.category_uid` to `ocsf.category_uid`
          enabled: true
          sources:
            - ocsf.category_uid
          sourceType: attribute
          target: ocsf.category_uid
          targetType: attribute
          targetFormat: integer
          preserveSource: false
          overrideOnConflict: false
        - type: attribute-remapper
          name: Map `ocsf.metadata.product.version` to `ocsf.metadata.product.version`
          enabled: true
          sources:
            - ocsf.metadata.product.version
          sourceType: attribute
          target: ocsf.metadata.product.version
          targetType: attribute
          targetFormat: string
          preserveSource: false
          overrideOnConflict: false
        - type: attribute-remapper
          name: Map `ocsf.severity_id` to `ocsf.severity_id`
          enabled: true
          sources:
            - ocsf.severity_id
          sourceType: attribute
          target: ocsf.severity_id
          targetType: attribute
          targetFormat: integer
          preserveSource: false
          overrideOnConflict: false
        - type: arithmetic-processor
          name: Type ID calculator
          enabled: true
          expression: (ocsf.class_uid * 100) + ocsf.activity_id
          target: ocsf.type_uid
          replaceMissing: false
        - type: attribute-remapper
          name: Map `ocsf.type_uid` to `ocsf.type_uid`
          enabled: true
          sources:
            - ocsf.type_uid
          sourceType: attribute
          target: ocsf.type_uid
          targetType: attribute
          targetFormat: integer
          preserveSource: false
          overrideOnConflict: false
